In [58]:
import pandas as pd

data = {'Roll no.':  ['1', '2','3','4','5'],
        'Name': ['John', 'Chris','Amelia','Kevin', 'Olivia',],
        'Gender': ['M', 'M','F','M', 'F',],
        'Marks 1': [61,68,98,86,19,],
        'Marks 2': [83, 96,39,48, 100,],
        'Marks 3': [97,99,76,95,54,],
                                          
        }

df = pd.DataFrame(data)

print (df)

  Roll no.    Name Gender  Marks 1  Marks 2  Marks 3
0        1    John      M       61       83       97
1        2   Chris      M       68       96       99
2        3  Amelia      F       98       39       76
3        4   Kevin      M       86       48       95
4        5  Olivia      F       19      100       54

In [59]:
df["TotalMarks"]=df["Marks 1"] + df["Marks 2"]+ df["Marks 3"]
df

  Roll no.    Name Gender  Marks 1  Marks 2  Marks 3  TotalMarks
0        1    John      M       61       83       97         241
1        2   Chris      M       68       96       99         263
2        3  Amelia      F       98       39       76         213
3        4   Kevin      M       86       48       95         229
4        5  Olivia      F       19      100       54         173

In [60]:
minvalue = df.min()
print(minvalue)

Roll no.           1
Name          Amelia
Gender             F
Marks 1           19
Marks 2           39
Marks 3           54
TotalMarks       173
dtype: object

In [61]:
maxvalue = df.max()
print(maxvalue)

Roll no.           5
Name          Olivia
Gender             M
Marks 1           98
Marks 2          100
Marks 3           99
TotalMarks       263
dtype: object

In [62]:
df["Marks 3"].mean()

84.2

In [63]:
import numpy as np
np.mean(df['Marks 1']+df['Marks 2']+df['Marks 3'])

223.8

In [64]:
df["Average"]=df["TotalMarks"]/3
df

  Roll no.    Name Gender  Marks 1  Marks 2  Marks 3  TotalMarks    Average
0        1    John      M       61       83       97         241  80.333333
1        2   Chris      M       68       96       99         263  87.666667
2        3  Amelia      F       98       39       76         213  71.000000
3        4   Kevin      M       86       48       95         229  76.333333
4        5  Olivia      F       19      100       54         173  57.666667

In [65]:
df.loc[df["Average"]==df["Average"].max()].Name

1    Chris
Name: Name, dtype: object

In [66]:
df = df[df["Marks 2"]<40]
df

  Roll no.    Name Gender  Marks 1  Marks 2  Marks 3  TotalMarks  Average
2        3  Amelia      F       98       39       76         213     71.0